{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Task07.ipynb","provenance":[],"collapsed_sections":[]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.8.12"}},"cells":[{"cell_type":"markdown","metadata":{"id":"nOOPLCHF7hLB"},"source":["**Task 07: Querying RDF(s)**"]},{"cell_type":"code","metadata":{"id":"Yl9npCt8n6m-","outputId":"635e289e-59e3-4371-b885-de25d8b14361"},"source":["!pip install rdflib \n","github_storage = \"https://raw.githubusercontent.com/AndreaCimminoArriaga/LinkedData2021-2022/main/Assignment4/\""],"execution_count":null,"outputs":[{"name":"stdout","output_type":"stream","text":["Requirement already satisfied: rdflib in c:\\users\\xdavi\\anaconda3\\lib\\site-packages (6.0.2)\n","Requirement already satisfied: isodate in c:\\users\\xdavi\\anaconda3\\lib\\site-packages (from rdflib) (0.6.0)\n","Requirement already satisfied: setuptools in c:\\users\\xdavi\\anaconda3\\lib\\site-packages (from rdflib) (58.0.4)\n","Requirement already satisfied: pyparsing in c:\\users\\xdavi\\anaconda3\\lib\\site-packages (from rdflib) (2.4.7)\n","Requirement already satisfied: six in c:\\users\\xdavi\\anaconda3\\lib\\site-packages (from isodate->rdflib) (1.16.0)\n"]}]},{"cell_type":"markdown","metadata":{"id":"XY7aPc86Bqoo"},"source":["Leemos el fichero RDF de la forma que lo hemos venido haciendo"]},{"cell_type":"code","metadata":{"id":"9ERh415on7kF","outputId":"93eeaa96-92c2-4fd3-f9d7-7a5525c9937b"},"source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","g = Graph()\n","g.namespace_manager.bind('ns', Namespace(\"http://somewhere#\"), override=False)\n","g.namespace_manager.bind('vcard', Namespace(\"http://www.w3.org/2001/vcard-rdf/3.0#\"), override=False)\n","g.parse(github_storage+\"/resources/example6.rdf\", format=\"xml\")"],"execution_count":null,"outputs":[{"data":{"text/plain":["<Graph identifier=N96dea9128c994af2818fc4f0921fd4c8 (<class 'rdflib.graph.Graph'>)>"]},"execution_count":2,"metadata":{},"output_type":"execute_result"}]},{"cell_type":"markdown","metadata":{"id":"qp1oe2Eddsvo"},"source":["**TASK 7.1: List all subclasses of \"Person\" with RDFLib and SPARQL**"]},{"cell_type":"code","metadata":{"id":"d53VpVzNpG0M","outputId":"3cbf27db-7e98-426f-ecb7-93cd1a032db2"},"source":["ns = Namespace(\"http://somewhere#\")\n","for sub,pred,obj in g.triples((None, RDFS.subClassOf, ns.Person)):\n","    print(sub)"],"execution_count":null,"outputs":[{"name":"stdout","output_type":"stream","text":["http://somewhere#Researcher\n"]}]},{"cell_type":"code","metadata":{"id":"G2Dh1r7KpG0M","outputId":"74d3b3c9-9058-4c86-b7a5-8c53fb1a910c"},"source":["from rdflib.plugins.sparql import prepareQuery\n","\n","\n","ns = Namespace(\"http://somewhere#\")\n","\n","\n","q1 = prepareQuery('''\n","  PREFIX RDFS: <http://www.w3.org/2000/01/rdf-schema#>\n","  SELECT \n","    ?Subclass\n","  WHERE { \n","    ?Subclass RDFS:subClassOf ns:Person. \n","  }\n","  ''',\n","  initNs = { \"ns\": ns}\n",")\n","\n","\n","for r in g.query(q1):\n","  print(r)"],"execution_count":null,"outputs":[{"name":"stdout","output_type":"stream","text":["(rdflib.term.URIRef('http://somewhere#Researcher'),)\n"]}]},{"cell_type":"markdown","metadata":{"id":"gM3DASkTQQ5Y"},"source":["**TASK 7.2: List all individuals of \"Person\" with RDFLib and SPARQL (remember the subClasses)**\n"]},{"cell_type":"code","metadata":{"id":"bGsIF49PpG0O","outputId":"69198f8d-d2c8-4f6a-f3a9-37e27b9a9074"},"source":["ns = Namespace(\"http://somewhere#\")\n","for sub,pred,obj in g.triples((None ,RDF.type, ns.Person)):\n","        print(sub)\n","for sub,pred,obj in g.triples((None, RDFS.subClassOf, ns.Person)):\n","    for sub,pred,obj in g.triples((None ,RDF.type, sub)):\n","        print(sub)"],"execution_count":null,"outputs":[{"name":"stdout","output_type":"stream","text":["http://somewhere#SaraJones\n","http://somewhere#JohnSmith\n","http://somewhere#JaneSmith\n"]}]},{"cell_type":"code","metadata":{"id":"WOOjVfKIpG0O","outputId":"85a634c6-eb23-4677-fc92-163f9bb0890c"},"source":["from rdflib.plugins.sparql import prepareQuery\n","\n","\n","ns = Namespace(\"http://somewhere#\")\n","\n","\n","q1 = prepareQuery('''\n","  PREFIX RDFS: <http://www.w3.org/2000/01/rdf-schema#>\n","  SELECT \n","    ?Persons\n","  WHERE { \n","    {?Persons a ns:Person.} UNION {?class RDFS:subClassOf ns:Person. ?Persons a ?class}\n","  }\n","  ''',\n","  initNs = { \"ns\": ns}\n",")\n","\n","\n","for r in g.query(q1):\n","  print(r)"],"execution_count":null,"outputs":[{"name":"stdout","output_type":"stream","text":["(rdflib.term.URIRef('http://somewhere#SaraJones'),)\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'),)\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'),)\n"]}]},{"cell_type":"markdown","metadata":{"id":"MXBqtBkJd22I"},"source":["**TASK 7.3: List all individuals of \"Person\" and all their properties including their class with RDFLib and SPARQL**\n"]},{"cell_type":"code","metadata":{"id":"jhDnXhWIpG0P","outputId":"08260d18-2e3d-45ff-f7f7-3913789c98fe"},"source":["ns = Namespace(\"http://somewhere#\")\n","for individuals,pred,obj in g.triples((None, RDF.type, ns.Person)):\n","    for sub,properties,obj in g.triples((individuals, None, None)):\n","        for sub,obj,classes in g.triples((properties, RDF.type, None)):\n","            print(individuals,properties,classes)\n","for subclass,pred,obj in g.triples((None, RDFS.subClassOf, ns.Person)):\n","    for individuals,pred,obj in g.triples((None ,RDF.type, subclass)):\n","        for y,properties,obj in g.triples((individuals, None, None)):\n","            for sub,pred,classes in g.triples((properties, RDF.type, None)):\n","                print(individuals,properties,classes)\n"],"execution_count":null,"outputs":[{"name":"stdout","output_type":"stream","text":["http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given http://www.w3.org/2000/01/rdf-schema#Datatype\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN http://www.w3.org/2000/01/rdf-schema#Datatype\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family http://www.w3.org/2000/01/rdf-schema#Property\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given http://www.w3.org/2000/01/rdf-schema#Datatype\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN http://www.w3.org/2000/01/rdf-schema#Datatype\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family http://www.w3.org/2000/01/rdf-schema#Property\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given http://www.w3.org/2000/01/rdf-schema#Datatype\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN http://www.w3.org/2000/01/rdf-schema#Datatype\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family http://www.w3.org/2000/01/rdf-schema#Property\n"]}]},{"cell_type":"code","metadata":{"id":"JAafMMoTpG0Q","outputId":"d6c3fe53-3a5e-4818-f711-c97be46c3825"},"source":["from rdflib.plugins.sparql import prepareQuery\n","\n","\n","ns = Namespace(\"http://somewhere#\")\n","\n","\n","q1 = prepareQuery('''\n","  PREFIX RDFS: <http://www.w3.org/2000/01/rdf-schema#>\n","  SELECT ?Persons ?properties ?class\n","  WHERE {\n","    {?individuals a ns:Person. ?individuals ?properties ?y.?properties a ?class.} UNION {?subclass RDFS:subClassOf ns:Person. ?individuals a ?subclass. ?individuals ?properties ?z. ?properties a ?class}\n","  }\n","  ''',\n","  initNs = { \"ns\": ns}\n",")\n","\n","\n","for r in g.query(q1):\n","  print(r)"],"execution_count":null,"outputs":[{"name":"stdout","output_type":"stream","text":["(None, rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#Datatype'))\n","(None, rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#Datatype'))\n","(None, rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#Property'))\n","(None, rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#Datatype'))\n","(None, rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#Datatype'))\n","(None, rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#Property'))\n","(None, rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#Datatype'))\n","(None, rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#Datatype'))\n","(None, rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#Property'))\n"]}]},{"cell_type":"code","metadata":{"id":"nTr9_5u9pG0Q"},"source":[""],"execution_count":null,"outputs":[]}]}